src/Trade/cf/InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Trade/cf/Enums/СтатусыЗаказовКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОформленияДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Trade/cf/InformationRegisters/СтатусыДокументов/Ext/ManagerModule.bsl
#Область Брокер

Функция ВыгружаемыеРеквизиты() Экспорт

	Результат = Новый Массив();
	
	Результат.Добавить("Документ");
	Результат.Добавить("Статус");
	
	Возврат Результат;	
	
КонецФункции

Функция ДанныеОбъектаКВыгрузке(Объект) Экспорт
	
	ПолноеИмя = Объект.Метаданные().ПолноеИмя();
	ДанныеОбъекта = ОбменСообщениямиПодготовкаСообщенияСервер.ШаблонСообщенияДляПреобразованияОбъектаВJSON();
    ДанныеОбъекта.ПолноеИмяОбъектаМетаданных = ПолноеИмя;
	
	Записи = Новый Массив();
	
	// Так как регистр может содержать много записей
	Для Каждого Запись Из Объект Цикл
		
		ВыгружаемыеСтатусы = Перечисления.СтатусыЗаказовКлиента.ВыгружаемыеСтатусы();
		
		Если ВыгружаемыеСтатусы.Найти(Запись.Статус) <> Неопределено Тогда 
			
			Справочники.ИсходящиеСообщения.ЗарегистрироватьСообщениеДляОтправки(Запись.Документ.ПолучитьОбъект());
			
			Результат = ВыгрузитьЗаписьИзНабораЗаписей(Запись, ПолноеИмя);
			Записи.Добавить(Результат);
		
		КонецЕсли;
		
	КонецЦикла;		
	
	Если Записи.Количество() > 0 Тогда
	
		ДанныеОбъекта.Записи = Записи;
		
	Иначе
		
		ДанныеОбъекта = Неопределено;
		
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции 

Функция ВыгрузитьЗаписьИзНабораЗаписей(ЗаписьВРегистре, ПолноеИмя)
	
	ВыгружаемыеРеквизиты = ВыгружаемыеРеквизиты();	
		
	ДанныеЗаписи = Новый Структура();
	
	Для Каждого ВыгружаемыйРеквизит Из ВыгружаемыеРеквизиты Цикл
		
		Значение = ЗаписьВРегистре[ВыгружаемыйРеквизит];
		Тип = ТипЗнч(Значение);
		
		Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда 
			ПолноеИмяОбъекта 	= Значение.Метаданные().ПолноеИмя();
			МенеджерОбъекта 	= ОбменСообщениямиСлужебный.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта); 
			ДанныеОбъекта 		= МенеджерОбъекта.ДанныеОбъектаКВыгрузке(Значение);
			ДанныеЗаписи.Вставить(ВыгружаемыйРеквизит, ДанныеОбъекта);
		Иначе
			ДанныеЗаписи.Вставить(ВыгружаемыйРеквизит, Значение);	
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ДанныеЗаписи;
	
КонецФункции

Процедура ЗагрузитьСтатусы(ДанныеСообщения) Экспорт
	
	Записи = ДанныеСообщения.Записи;
	
	Для Каждого Запись Из Записи Цикл
		
		Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(Запись.Документ.Реквизиты.Идентификатор));	
		
		СоответствиеСтатусов = СоответствиеСтатусовЗаказовКлиентаЗаказамНаСборку();
		Статус = СоответствиеСтатусов[Запись.Статус.Реквизиты.Имя];
		
		НоваяЗапись = РегистрыСведений.СтатусыДокументов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Документ 	= Ссылка;
		НоваяЗапись.Статус 		= Статус;
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры


Функция СоответствиеСтатусовЗаказовКлиентаЗаказамНаСборку() 

	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("ГотовКОтгрузке", Перечисления.СтатусыЗаказовКлиента.ОжидаетОформленияДокументов);
	Соответствие.Вставить("Отгружено", Перечисления.СтатусыЗаказовКлиента.Отгружено);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти
